[
  {
    "id": "832208",
    "title": "asc",
    "description": "asc",
    "creator": "raghav7533",
    "created_at": "21 Sep 2024",
    "insights": "asc",
    "status": "in_progress",
    "question_count": 5,
    "follow_up_questions": 0,
    "interview_tone": "formal",
    "problem_description": "asc",
    "questions": [
      {
        "main_question": "Which app are you currently using to order food?",
        "if user gives generic answer": "Which features of the app do you find most useful?",
        "probe if needed": "Can you share any specific examples of how the app has made your food ordering experience better?",
        "probe if vague": "Can you elaborate on your experience with the app?",
        "probe gently if broad answer": "Can you provide more details about what you like or dislike about the app?"
      },
      {
        "main_question": "What factors do you consider when deciding which food delivery app to use?",
        "if user gives generic answer": "What are the most important features for you when choosing a food delivery app?",
        "probe if needed": "Can you give an example of a time when a certain feature influenced your decision to use a particular app?",
        "probe if vague": "Can you explain your decision-making process when choosing a food delivery app?",
        "probe gently if broad answer": "Can you provide more details about why you prioritize those factors when choosing an app?"
      },
      {
        "main_question": "How often do you order food through a delivery app?",
        "if user gives generic answer": "What are the main reasons for your frequency of using food delivery apps?",
        "probe if needed": "Can you provide examples of when you use a food delivery app and when you don't?",
        "probe if vague": "Can you elaborate on your experience with using food delivery apps?",
        "probe gently if broad answer": "Can you provide more details about your habits and preferences when it comes to ordering food through an app?"
      },
      {
        "main_question": "What do you think are the most common reasons for people to order food through a delivery app?",
        "if user gives generic answer": "What are your personal reasons for using food delivery apps?",
        "probe if needed": "Can you give any specific examples of when you use a food delivery app and when you don't?",
        "probe if vague": "Can you explain your thoughts and experiences with food delivery apps?",
        "probe gently if broad answer": "Can you provide more details about your reasons for using food delivery apps and how they differ from others?"
      },
      {
        "main_question": "How satisfied are you with your current food delivery app?",
        "if user gives generic answer": "What aspects of the app do you feel satisfied or dissatisfied with?",
        "probe if needed": "Can you share an example of when you were particularly satisfied or dissatisfied with the app?",
        "probe if vague": "Can you elaborate on your overall satisfaction with the app?",
        "probe gently if broad answer": "Can you provide more details about your satisfaction level and any factors that contribute to it?"
      },
      {
        "main_question": "What features do you wish your current food delivery app had?",
        "if user gives generic answer": "Which of these features do you consider the most important?",
        "probe if needed": "Can you give an example of a time when you needed a certain feature that your current app doesn't have?",
        "probe if vague": "Can you explain your thoughts and preferences regarding features of food delivery apps?",
        "probe gently if broad answer": "Can you provide more details about any specific features you feel are lacking in your current app?"
      },
      {
        "main_question": "Do you think food delivery apps have improved your overall food ordering experience?",
        "if user gives generic answer": "Which aspects of the food ordering experience do you feel have improved with the use of apps?",
        "probe if needed": "Can you give an example of how using a food delivery app has made your experience better?",
        "probe if vague": "Can you elaborate on your thoughts and experiences with using food delivery apps?",
        "probe gently if broad answer": "Can you provide more details about your overall experience with food delivery apps and how they have impacted your food ordering habits?"
      },
      {
        "main_question": "What do you think is the future of food delivery apps in India?",
        "if user gives generic answer": "What are your personal predictions for the future of food delivery apps in India?",
        "probe if needed": "Can you provide any specific examples or reasons for your predictions?",
        "probe if vague": "Can you elaborate on your thoughts and opinions on the future of food delivery apps in India?",
        "probe gently if broad answer": "Can you provide more details about your ideas and theories on the future of food delivery apps in India?"
      }
    ]
  },
  {
    "id": "713029",
    "title": "Hello",
    "description": "Just want responses. Ask about their personal lives",
    "creator": "raghav7533",
    "created_at": "21 Sep 2024",
    "insights": "Hello create a generic survey",
    "status": "in_progress",
    "question_count": 5,
    "follow_up_questions": 0,
    "interview_tone": "formal",
    "problem_description": "Just want responses. Ask about their personal lives",
    "questions": [
      {
        "main_question": "Which food delivery app do you use most frequently?",
        "if user gives generic answer": "Can you tell me more about that?",
        "probe if needed": "Why do you prefer that app?",
        "probe if vague": "Can you provide more details?",
        "probe gently if broad answer": "Can you give me an example of a time when you used the app?"
      },
      {
        "main_question": "What factors do you consider when choosing a food delivery app?",
        "if user gives generic answer": "Can you tell me more about that?",
        "probe if needed": "How important are these factors to you?",
        "probe if vague": "Can you provide more details?",
        "probe gently if broad answer": "Can you give me an example of a time when you considered these factors?"
      },
      {
        "main_question": "How often do you order food through a delivery app?",
        "if user gives generic answer": "Can you tell me more about that?",
        "probe if needed": "What influences how often you order through a delivery app?",
        "probe if vague": "Can you provide more details?",
        "probe gently if broad answer": "Can you give me an example of a time when you ordered food through a delivery app?"
      },
      {
        "main_question": "What are your favorite types of food to order through a delivery app?",
        "if user gives generic answer": "Can you tell me more about that?",
        "probe if needed": "Why do you enjoy ordering these types of food?",
        "probe if vague": "Can you provide more details?",
        "probe gently if broad answer": "Can you give me an example of a time when you ordered your favorite type of food through a delivery app?"
      },
      {
        "main_question": "What features do you look for in a food delivery app?",
        "if user gives generic answer": "Can you tell me more about that?",
        "probe if needed": "How important are these features to you?",
        "probe if vague": "Can you provide more details?",
        "probe gently if broad answer": "Can you give me an example of a time when you used these features in a food delivery app?"
      },
      {
        "main_question": "How would you rate the user experience of your current food delivery app?",
        "if user gives generic answer": "Can you tell me more about that?",
        "probe if needed": "What specific aspects of the user experience do you like or dislike?",
        "probe if vague": "Can you provide more details?",
        "probe gently if broad answer": "Can you give me an example of a time when you had a good or bad user experience with a food delivery app?"
      },
      {
        "main_question": "What improvements would you like to see in your current food delivery app?",
        "if user gives generic answer": "Can you tell me more about that?",
        "probe if needed": "What specific changes would you like to see?",
        "probe if vague": "Can you provide more details?",
        "probe gently if broad answer": "Can you give me an example of a time when you wished your food delivery app had a certain feature?"
      },
      {
        "main_question": "Do you use any local or regional food delivery apps instead of larger, more popular ones?",
        "if user gives generic answer": "Can you tell me more about that?",
        "probe if needed": "Why do you prefer these local or regional apps?",
        "probe if vague": "Can you provide more details?",
        "probe gently if broad answer": "Can you give me an example of a time when you used a local or regional food delivery app instead of a larger one?"
      },
      {
        "main_question": "What are your thoughts on the pricing of food delivery apps?",
        "if user gives generic answer": "Can you tell me more about that?",
        "probe if needed": "How do you think the pricing could be improved?",
        "probe if vague": "Can you provide more details?",
        "probe gently if broad answer": "Can you give me an example of a time when you had an issue with the pricing of a food delivery app?"
      }
    ]
  },
  {
    "id": "233719",
    "title": "asc",
    "description": "asc",
    "creator": "raghav7533",
    "created_at": "21 Sep 2024",
    "insights": "asc",
    "status": "in_progress",
    "question_count": 5,
    "follow_up_questions": 0,
    "interview_tone": "formal",
    "problem_description": "asc",
    "questions": [
      {
        "main_question": "Which app do you usually use to order food?",
        "if user gives generic answer": "Could you be more specific?",
        "probe if needed": "Can you tell me why you prefer that app?",
        "probe if vague": "Can you tell me more about your experience with that app?",
        "probe gently if broad answer": "Could you share any specific instances where you faced issues with that app?"
      },
      {
        "main_question": "Do you use any food delivery apps regularly?",
        "if user gives generic answer": "Can you name some of the apps you use?",
        "probe if needed": "What features do you like in those apps?",
        "probe if vague": "Can you explain why you chose those apps?",
        "probe gently if broad answer": "Do you face any difficulties while using those apps?"
      },
      {
        "main_question": "What factors do you consider while ordering food from an app?",
        "if user gives generic answer": "Could you elaborate on that?",
        "probe if needed": "Do you prioritize any specific factors while ordering food?",
        "probe if vague": "Can you give me an example of when these factors influenced your decision?",
        "probe gently if broad answer": "Do you think these factors have changed over time?"
      },
      {
        "main_question": "How often do you order food from an app?",
        "if user gives generic answer": "Could you give me a rough estimate?",
        "probe if needed": "Do you order more frequently on certain days or times?",
        "probe if vague": "Can you tell me about your ordering frequency in the past month?",
        "probe gently if broad answer": "Have you noticed any changes in your ordering frequency recently?"
      },
      {
        "main_question": "What do you think are the advantages of using a food delivery app?",
        "if user gives generic answer": "Could you provide some examples?",
        "probe if needed": "Do you feel like these advantages outweigh the disadvantages?",
        "probe if vague": "Can you elaborate on the advantages?",
        "probe gently if broad answer": "Do you think these advantages are unique to food delivery apps?"
      },
      {
        "main_question": "Do you face any challenges while using food delivery apps?",
        "if user gives generic answer": "Can you give me some specific instances?",
        "probe if needed": "Have you faced any of these challenges while using other apps?",
        "probe if vague": "Can you tell me more about these challenges?",
        "probe gently if broad answer": "Do these challenges affect your overall experience with the app?"
      },
      {
        "main_question": "What are your thoughts on the user interface of food delivery apps?",
        "if user gives generic answer": "Could you provide some specific feedback?",
        "probe if needed": "Do you think the interface is user-friendly?",
        "probe if vague": "Can you elaborate on your thoughts about the UI?",
        "probe gently if broad answer": "Do you think the interface could be improved in any way?"
      },
      {
        "main_question": "How important is the variety of food options on a food delivery app for you?",
        "if user gives generic answer": "Can you elaborate on that?",
        "probe if needed": "Do you consider the variety of options when choosing an app?",
        "probe if vague": "Can you give me an example of when the variety of options influenced your decision?",
        "probe gently if broad answer": "Do you think the variety of options has increased over time?"
      },
      {
        "main_question": "What do you think is the most important factor for a food delivery app to be successful?",
        "if user gives generic answer": "Can you provide any examples?",
        "probe if needed": "Do you think this factor varies depending on the location?",
        "probe if vague": "Can you explain why you think this factor is important?",
        "probe gently if broad answer": "Do you think this factor has changed over time?"
      },
      {
        "main_question": "How satisfied are you with the overall experience of using food delivery apps?",
        "if user gives generic answer": "Could you elaborate on that?",
        "probe if needed": "Do you think there are any areas that could be improved?",
        "probe if vague": "Can you provide some specific feedback on your experience?",
        "probe gently if broad answer": "Do you think the overall experience has improved in the past year?"
      }
    ]
  },
  {
    "id": "158063",
    "title": "asc",
    "description": "asc",
    "creator": "raghav7533",
    "created_at": "21 Sep 2024",
    "insights": "asc",
    "status": "in_progress",
    "question_count": 5,
    "follow_up_questions": 0,
    "interview_tone": "formal",
    "problem_description": "asc",
    "questions": [
      {
        "main_question": "Can you tell us why you order food instead of cooking?",
        "if user gives generic answer": "Can you provide some more details about your reasons?",
        "probe if needed": "What factors influence your decision to order food?",
        "probe if vague": "Can you elaborate on what you mean by that?",
        "probe gently if broad answer": "Can you give us a specific example of a time when you ordered food instead of cooking?"
      },
      {
        "main_question": "Which food delivery app do you currently use?",
        "if user gives generic answer": "Can you tell us more about your experience with the app?",
        "probe if needed": "What features do you like or dislike about the app?",
        "probe if vague": "Could you specify which app you use?",
        "probe gently if broad answer": "Can you tell us about a recent experience you had with the app?"
      },
      {
        "main_question": "What do you think are the top reasons why people in India order food?",
        "if user gives generic answer": "Can you provide more specific examples of these reasons?",
        "probe if needed": "Do you think there are any cultural or societal factors that contribute to the popularity of ordering food in India?",
        "probe if vague": "Can you explain what you mean by 'top reasons'?",
        "probe gently if broad answer": "Can you give us some examples of when you or someone you know has ordered food in India?"
      },
      {
        "main_question": "How often do you order food in a week?",
        "if user gives generic answer": "Can you provide more details about your ordering frequency?",
        "probe if needed": "Do you tend to order more on specific days or times?",
        "probe if vague": "Can you clarify what you mean by 'often'?",
        "probe gently if broad answer": "Can you give us an estimate of how many times you ordered food in the past week?"
      },
      {
        "main_question": "What do you consider when choosing a restaurant to order from?",
        "if user gives generic answer": "Can you provide more specific examples of what you look for?",
        "probe if needed": "Are there any specific criteria that you prioritize when choosing a restaurant?",
        "probe if vague": "Could you explain what factors influence your decision?",
        "probe gently if broad answer": "Can you tell us about a time when you were deciding between different restaurants to order from?"
      },
      {
        "main_question": "What are your top reasons for using food delivery apps?",
        "if user gives generic answer": "Can you provide more specific examples of these reasons?",
        "probe if needed": "Do you think there are any specific features or benefits of food delivery apps that attract you?",
        "probe if vague": "Could you explain what you mean by 'top reasons'?",
        "probe gently if broad answer": "Can you give us some examples of when you have used a food delivery app and why?"
      },
      {
        "main_question": "Do you often try new restaurants or stick to your favorites when ordering food?",
        "if user gives generic answer": "Can you provide more details about your preferences?",
        "probe if needed": "Do you think trying new restaurants through food delivery apps is important for you?",
        "probe if vague": "Can you clarify what you mean by 'often'?",
        "probe gently if broad answer": "Can you tell us about your experience trying a new restaurant through a food delivery app?"
      },
      {
        "main_question": "What challenges do you face when ordering food through an app?",
        "if user gives generic answer": "Can you provide more specific examples of these challenges?",
        "probe if needed": "Do you think these challenges can be addressed by the app or the restaurant?",
        "probe if vague": "Could you explain what you mean by 'challenges'?",
        "probe gently if broad answer": "Can you tell us about a time when you faced a challenge while ordering food through an app?"
      },
      {
        "main_question": "What do you usually order through food delivery apps?",
        "if user gives generic answer": "Can you provide more details about your usual orders?",
        "probe if needed": "Do you have any specific preferences or restrictions when choosing what to order?",
        "probe if vague": "Could you clarify what you mean by 'usually'?",
        "probe gently if broad answer": "Can you tell us about a recent order you placed through a food delivery app?"
      }
    ]
  },
  {
    "id": "294113",
    "title": "asc",
    "description": "asc",
    "creator": "raghav7533",
    "created_at": "21 Sep 2024",
    "insights": "asc",
    "status": "in_progress",
    "question_count": 5,
    "follow_up_questions": 0,
    "interview_tone": "formal",
    "problem_description": "asc",
    "questions": [
      {
        "main_question": "Which food ordering app do you use most frequently?",
        "if user gives generic answer": "Can you tell me more about your experience with that app?",
        "probe if needed": "What features do you like about the app?",
        "probe if vague": "Can you give me an example of a time when you used the app?",
        "probe gently if broad answer": "Can you elaborate on what you mean by 'good'?"
      },
      {
        "main_question": "Do you typically order food for delivery or pickup?",
        "if user gives generic answer": "What factors influence your decision to choose delivery or pickup?",
        "probe if needed": "Can you tell me about any specific experiences you've had with delivery or pickup?",
        "probe if vague": "Can you give me an example of a time when you ordered food for delivery or pickup?",
        "probe gently if broad answer": "Can you expand on what you mean by 'inconvenient'?"
      },
      {
        "main_question": "How often do you order food from a restaurant?",
        "if user gives generic answer": "What prompts you to order food from a restaurant?",
        "probe if needed": "Can you tell me about any specific occasions when you ordered food from a restaurant?",
        "probe if vague": "Can you give me an example of a time when you ordered food from a restaurant?",
        "probe gently if broad answer": "Can you explain what you mean by 'too often'?"
      },
      {
        "main_question": "What are your top three favorite types of cuisine to order?",
        "if user gives generic answer": "Can you tell me more about why you enjoy those types of cuisine?",
        "probe if needed": "Can you give me an example of a time when you ordered one of your favorite cuisines?",
        "probe if vague": "Can you explain what you mean by 'favorite'?",
        "probe gently if broad answer": "Can you expand on what you mean by 'good'?"
      },
      {
        "main_question": "What do you look for in a food ordering app?",
        "if user gives generic answer": "Can you tell me more about what features or qualities you value in a food ordering app?",
        "probe if needed": "Can you give me an example of a time when you used a food ordering app that had those features or qualities?",
        "probe if vague": "Can you explain what you mean by 'important'?",
        "probe gently if broad answer": "Can you expand on what you mean by 'good'?"
      },
      {
        "main_question": "Have you ever had a negative experience while ordering food?",
        "if user gives generic answer": "Can you tell me more about that experience?",
        "probe if needed": "Can you give me an example of a time when you had a negative experience while ordering food?",
        "probe if vague": "Can you explain what you mean by 'negative'?",
        "probe gently if broad answer": "Can you expand on what you mean by 'not good'?"
      },
      {
        "main_question": "What do you think is the most important factor in deciding which food ordering app to use?",
        "if user gives generic answer": "Can you tell me more about why that factor is important to you?",
        "probe if needed": "Can you give me an example of a time when you chose to use a specific food ordering app based on that factor?",
        "probe if vague": "Can you explain what you mean by 'important'?",
        "probe gently if broad answer": "Can you expand on what you mean by 'good'?"
      },
      {
        "main_question": "What are your thoughts on the user interface of food ordering apps?",
        "if user gives generic answer": "Can you tell me more about what you like or dislike about the user interface?",
        "probe if needed": "Can you give me an example of a time when you found the user interface of a food ordering app to be particularly helpful or frustrating?",
        "probe if vague": "Can you explain what you mean by 'good' or 'bad'?",
        "probe gently if broad answer": "Can you expand on what you mean by 'easy to use'?"
      }
    ]
  },
  {
    "id": "303098",
    "title": "Hello",
    "description": "Ask about them",
    "creator": "raghav7533",
    "created_at": "21 Sep 2024",
    "insights": "create a generic survey",
    "status": "in_progress",
    "question_count": 5,
    "follow_up_questions": 0,
    "interview_tone": "formal",
    "problem_description": "Ask about them",
    "questions": [],
    "agent_id": "agent_acd80427a08e3ee02688f24a34"
  },
  {
    "id": "108211",
    "title": "Hello",
    "description": "Ask them about them",
    "creator": "raghav7533",
    "created_at": "21 Sep 2024",
    "insights": "Create a generic survey",
    "status": "in_progress",
    "question_count": 5,
    "follow_up_questions": 0,
    "interview_tone": "formal",
    "problem_description": "Ask them about them",
    "questions": [],
    "agent_id": "agent_88462c0b7eb37f5e2f54661290"
  },
  {
    "id": "312441",
    "title": "asc",
    "description": "asc",
    "creator": "raghav7533",
    "created_at": "21 Sep 2024",
    "insights": "asc",
    "status": "in_progress",
    "question_count": 5,
    "follow_up_questions": 0,
    "interview_tone": "formal",
    "problem_description": "asc",
    "questions": [
      {
        "main_question": "Which food delivery app do you currently use?",
        "if user gives generic answer": "Can you tell me more about your experience using that app?",
        "probe if needed": "What factors influenced your decision to choose that app?",
        "probe if vague": "Can you provide more specific details about your experience with that app?",
        "probe gently if broad answer": "Could you give me an example of a positive/negative experience you've had with that app?"
      },
      {
        "main_question": "What do you like/dislike about the food delivery apps you use?",
        "if user gives generic answer": "Can you provide a specific example of something you like/dislike about the app?",
        "probe if needed": "What improvements would you like to see in the app?",
        "probe if vague": "Can you elaborate on your experience with the app?",
        "probe gently if broad answer": "How does this feature/aspect of the app impact your overall experience?"
      },
      {
        "main_question": "Do you have any concerns about ordering food through delivery apps?",
        "if user gives generic answer": "Can you tell me more about your concerns?",
        "probe if needed": "Have you faced any specific issues while using delivery apps?",
        "probe if vague": "Can you provide more specific details about your concerns?",
        "probe gently if broad answer": "How do these concerns affect your decision to use delivery apps?"
      },
      {
        "main_question": "How often do you order food through delivery apps?",
        "if user gives generic answer": "Can you provide a specific example of a recent order?",
        "probe if needed": "What factors influence your frequency of using delivery apps?",
        "probe if vague": "Can you elaborate on your ordering habits?",
        "probe gently if broad answer": "How do these factors impact the frequency of your orders?"
      },
      {
        "main_question": "What are your top reasons for using food delivery apps?",
        "if user gives generic answer": "Can you provide specific examples of when you used the app for these reasons?",
        "probe if needed": "Do you find these reasons to be consistently met by the app?",
        "probe if vague": "Can you elaborate on your experiences with these reasons?",
        "probe gently if broad answer": "How do these reasons affect your overall satisfaction with the app?"
      },
      {
        "main_question": "What are your top frustrations when using food delivery apps?",
        "if user gives generic answer": "Can you provide specific examples of when you experienced these frustrations?",
        "probe if needed": "Do you find these frustrations to be common across different delivery apps?",
        "probe if vague": "Can you provide more specific details about your frustrations?",
        "probe gently if broad answer": "How do these frustrations impact your overall experience with delivery apps?"
      },
      {
        "main_question": "What features do you look for in a food delivery app?",
        "if user gives generic answer": "Can you provide specific examples of when these features were important to you?",
        "probe if needed": "What makes these features important to you?",
        "probe if vague": "Can you elaborate on your experiences with these features?",
        "probe gently if broad answer": "How do these features impact your overall satisfaction with the app?"
      },
      {
        "main_question": "Do you use any other methods to order food besides delivery apps?",
        "if user gives generic answer": "Can you tell me more about your experience using those methods?",
        "probe if needed": "What factors influence your decision to use other methods?",
        "probe if vague": "Can you provide more specific details about your experiences with other methods?",
        "probe gently if broad answer": "How do these methods compare to using delivery apps?"
      },
      {
        "main_question": "Have you ever encountered any issues with food delivery apps?",
        "if user gives generic answer": "Can you tell me more about your experience with those issues?",
        "probe if needed": "Have you encountered any specific issues that have caused you to stop using a particular app?",
        "probe if vague": "Can you provide more specific details about your experiences with issues?",
        "probe gently if broad answer": "How do these issues impact your overall satisfaction with delivery apps?"
      }
    ]
  },
  {
    "id": "151834",
    "title": "HEllo",
    "description": "ascasc",
    "creator": "raghav7533",
    "created_at": "21 Sep 2024",
    "insights": "aHe get me hhh",
    "status": "in_progress",
    "question_count": 5,
    "follow_up_questions": 0,
    "interview_tone": "formal",
    "problem_description": "ascasc",
    "questions": [
      {
        "main_question": "Which food delivery app do you use most frequently?",
        "if user gives generic answer": "Can you tell me more about your experience with that app?",
        "probe if needed": "What features do you like the most about that app?",
        "probe if vague": "Can you provide specific examples of how that app has been beneficial for you?",
        "probe gently if broad answer": "Could you give me some details on how that app compares to others you've used?"
      }
    ]
  },
  {
    "id": "586128",
    "title": "Hello",
    "description": "Ask about the user",
    "creator": "raghav7533",
    "created_at": "21 Sep 2024",
    "insights": "Create a generic surview",
    "status": "in_progress",
    "question_count": 5,
    "follow_up_questions": 0,
    "interview_tone": "formal",
    "problem_description": "Ask about the user",
    "questions": [
      {
        "main_question": "Which food ordering app do you currently use?",
        "if user gives generic answer": "Can you provide more specific details about the app you use?",
        "probe if needed": "Can you tell me more about your experience with the app?",
        "probe if vague": "Can you elaborate on your answer?",
        "probe gently if broad answer": "Can you give me an example of how you use the app?"
      }
    ]
  },
  {
    "id": "819216",
    "title": "asc",
    "description": "asc",
    "creator": "raghav7533",
    "created_at": "21 Sep 2024",
    "insights": "asc",
    "status": "in_progress",
    "question_count": 5,
    "follow_up_questions": 0,
    "interview_tone": "formal",
    "problem_description": "asc",
    "questions": [
      {
        "main_question": "Which food ordering app do you use?",
        "if user gives generic answer": "Can you tell me more about the app?",
        "probe if needed": "What features do you like about the app?",
        "probe if vague": "Can you be more specific?",
        "probe gently if broad answer": "Can you give me an example of a recent order you made using the app?"
      },
      {
        "main_question": "What do you think are the main reasons for using food ordering apps?",
        "if user gives generic answer": "Can you elaborate on that?",
        "probe if needed": "Do you find it more convenient than traditional food delivery services?",
        "probe if vague": "Can you give me an example of a specific reason?",
        "probe gently if broad answer": "Do you use any other methods for ordering food?"
      }
    ]
  },
  {
    "id": "601736",
    "title": "Hello HHH",
    "description": "Ask about the user",
    "creator": "raghav7533",
    "created_at": "21 Sep 2024",
    "insights": "AAA",
    "status": "in_progress",
    "question_count": 5,
    "follow_up_questions": 0,
    "interview_tone": "formal",
    "problem_description": "Ask about the user",
    "questions": [
      {
        "main_question": "What food delivery app do you currently use?",
        "if user gives generic answer": "Can you tell me more about the app?",
        "probe if needed": "What features do you like about the app?",
        "probe if vague": "Could you give a specific example of how you use the app?",
        "probe gently if broad answer": "Can you provide more details about your experience with the app?"
      },
      {
        "main_question": "What do you like most about the app you use?",
        "if user gives generic answer": "Can you provide an example of a time when the app exceeded your expectations?",
        "probe if needed": "What specific features or aspects do you like about the app?",
        "probe if vague": "Could you explain more about why you like the app?",
        "probe gently if broad answer": "Can you give more details about your positive experiences with the app?"
      }
    ]
  },
  {
    "id": "300841",
    "title": "Hello",
    "description": "Ask about the user",
    "creator": "raghav7533",
    "created_at": "21 Sep 2024",
    "insights": "HHH",
    "status": "in_progress",
    "question_count": 5,
    "follow_up_questions": 0,
    "interview_tone": "formal",
    "problem_description": "Ask about the user",
    "questions": [
      {
        "main_question": "Which food delivery app do you currently use?",
        "if user gives generic answer": "Can you provide more specific information?",
        "probe if needed": "What features do you like most about the app?",
        "probe if vague": "Can you elaborate on that?",
        "probe gently if broad answer": "Can you give an example?"
      },
      {
        "main_question": "What factors do you consider when choosing a food delivery app?",
        "if user gives generic answer": "Can you provide more specific information?",
        "probe if needed": "What are the most important factors to you?",
        "probe if vague": "Can you elaborate on that?",
        "probe gently if broad answer": "Can you give an example?"
      }
    ]
  },
  {
    "id": "159322",
    "title": "HEllo checking json ",
    "description": "HHH",
    "creator": "raghav7533",
    "created_at": "21 Sep 2024",
    "insights": "HHHH",
    "status": "in_progress",
    "question_count": 5,
    "follow_up_questions": 0,
    "interview_tone": "formal",
    "problem_description": "HHH",
    "questions": [
      {
        "main_question": "What food delivery app do you currently use?",
        "if user gives generic answer": "Can you tell me more about your experience with that app?",
        "probe if needed": "What do you like about the app?",
        "probe if vague": "Can you provide specific examples?",
        "probe gently if broad answer": "Can you elaborate on that?"
      },
      {
        "main_question": "What factors influence your decision to order food?",
        "if user gives generic answer": "Can you provide specific examples?",
        "probe if needed": "Which factor do you prioritize the most?",
        "probe if vague": "Can you tell me more about your thought process?",
        "probe gently if broad answer": "Can you elaborate on that?"
      }
    ],
    "agent_id": "agent_f6c76f296ebd40d362bd72e27e"
  },
  {
    "id": "328779",
    "title": "jjj hello",
    "description": "jjj",
    "creator": "raghav7533",
    "created_at": "21 Sep 2024",
    "insights": "testing",
    "status": "in_progress",
    "question_count": 5,
    "follow_up_questions": 0,
    "interview_tone": "formal",
    "problem_description": "jjj",
    "questions": [
      {
        "main_question": "What is your favorite food delivery app in India?",
        "if user gives generic answer": "Can you elaborate on why that app is your favorite?",
        "probe if needed": "",
        "probe if vague": "Can you provide more details about your experience using that app?",
        "probe gently if broad answer": "What specific features of that app do you like?"
      }
    ],
    "agent_id": "agent_002d3e773de3b83f103a2b84fe"
  },
  {
    "id": "207449",
    "title": "Hey Ritesh",
    "description": "Checking",
    "creator": "raghav7533",
    "created_at": "21 Sep 2024",
    "insights": "asca",
    "status": "in_progress",
    "question_count": 5,
    "follow_up_questions": 0,
    "interview_tone": "formal",
    "problem_description": "Checking",
    "questions": [
      {
        "main_question": "What is your favorite food ordering app and why?",
        "if user gives generic answer": "Can you tell me more about why it's your favorite?",
        "probe if needed": "What features do you like about the app?",
        "probe if vague": "Can you give me a specific example of why you prefer this app?",
        "probe gently if broad answer": "Can you elaborate on that?"
      },
      {
        "main_question": "What factors do you consider when choosing a food ordering app?",
        "if user gives generic answer": "Can you tell me more about that?",
        "probe if needed": "Do you prioritize certain features over others?",
        "probe if vague": "Can you provide an example of a factor that influences your decision?",
        "probe gently if broad answer": "Can you expand on that?"
      }
    ],
    "agent_id": "agent_4d900dc8b1daffd2f684513e52"
  },
  {
    "id": "498221",
    "title": "asc jj",
    "description": "asc jj",
    "creator": "raghav7533",
    "created_at": "21 Sep 2024",
    "insights": "asc jj",
    "status": "in_progress",
    "question_count": 5,
    "follow_up_questions": 0,
    "interview_tone": "formal",
    "problem_description": "asc jj",
    "questions": [
      {
        "main_question": "Which food delivery app do you use most frequently in India?",
        "if user gives generic answer": "Can you tell me more about why you use that app?",
        "probe if needed": "What factors do you consider when choosing which app to use?",
        "probe if vague": "Can you provide more specific details about your experience with that app?",
        "probe gently if broad answer": "Can you give me an example of a time when you used that app to order food?"
      }
    ],
    "agent_id": "agent_5b3497d91fb1173259a67a0fcc"
  },
  {
    "id": "273911",
    "title": "asc",
    "description": "asc",
    "creator": "raghav7533",
    "created_at": "21 Sep 2024",
    "insights": "asc",
    "status": "in_progress",
    "question_count": 5,
    "follow_up_questions": 0,
    "interview_tone": "formal",
    "problem_description": "asc",
    "questions": [
      {
        "main_question": "What food delivery app do you use most often?",
        "if user gives generic answer": "Can you specify which app?",
        "probe if needed": "What features do you like about that app?",
        "probe if vague": "Can you give a more detailed answer?",
        "probe gently if broad answer": "Can you provide a specific example?"
      },
      {
        "main_question": "What factors influence your decision to order food?",
        "if user gives generic answer": "Can you give specific examples?",
        "probe if needed": "Do you consider price or convenience?",
        "probe if vague": "Can you elaborate on that answer?",
        "probe gently if broad answer": "Can you provide a specific example?"
      }
    ],
    "agent_id": "agent_848f8a413e28fb9f9374ca463d"
  }
]